Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.0.23/samha0rb/atdf/ATSAMHA0G15RB.atdf
        <register modes="MODE1" name="EVCTRL" offset="0x4" rw="RW" size="2" initval="0x0000" caption="MODE1 Event Control">
          <bitfield name="PEREO0" caption="Periodic Interval 0 Event Output Enable" mask="0x1"/>
          <bitfield name="PEREO1" caption="Periodic Interval 1 Event Output Enable" mask="0x2"/>
          <bitfield name="PEREO2" caption="Periodic Interval 2 Event Output Enable" mask="0x4"/>
          <bitfield name="PEREO3" caption="Periodic Interval 3 Event Output Enable" mask="0x8"/>
          <bitfield name="PEREO4" caption="Periodic Interval 4 Event Output Enable" mask="0x10"/>
          <bitfield name="PEREO5" caption="Periodic Interval 5 Event Output Enable" mask="0x20"/>
          <bitfield name="PEREO6" caption="Periodic Interval 6 Event Output Enable" mask="0x40"/>
          <bitfield name="PEREO7" caption="Periodic Interval 7 Event Output Enable" mask="0x80"/>
          <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
          <bitfield name="CMPEO1" caption="Compare 1 Event Output Enable" mask="0x200"/>
          <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
        </register>
        <register modes="MODE2" name="EVCTRL" offset="0x4" rw="RW" size="2" initval="0x0000" caption="MODE2 Event Control">
          <bitfield name="PEREO0" caption="Periodic Interval 0 Event Output Enable" mask="0x1"/>
          <bitfield name="PEREO1" caption="Periodic Interval 1 Event Output Enable" mask="0x2"/>
          <bitfield name="PEREO2" caption="Periodic Interval 2 Event Output Enable" mask="0x4"/>
          <bitfield name="PEREO3" caption="Periodic Interval 3 Event Output Enable" mask="0x8"/>
          <bitfield name="PEREO4" caption="Periodic Interval 4 Event Output Enable" mask="0x10"/>
          <bitfield name="PEREO5" caption="Periodic Interval 5 Event Output Enable" mask="0x20"/>
          <bitfield name="PEREO6" caption="Periodic Interval 6 Event Output Enable" mask="0x40"/>
          <bitfield name="PEREO7" caption="Periodic Interval 7 Event Output Enable" mask="0x80"/>
          <bitfield name="ALARMEO0" caption="Alarm 0 Event Output Enable" mask="0x100"/>
          <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
        </register>
        <register modes="MODE0" name="INTENCLR" offset="0x6" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="MODE0 Interrupt Enable Clear">
          <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x40"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="MODE1" name="INTENCLR" offset="0x6" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="MODE1 Interrupt Enable Clear">
          <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x40"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="MODE2" name="INTENCLR" offset="0x6" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="MODE2 Interrupt Enable Clear">
          <bitfield name="ALARM0" caption="Alarm 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x40"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="MODE0" name="INTENSET" offset="0x7" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="MODE0 Interrupt Enable Set">
          <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x40"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="MODE1" name="INTENSET" offset="0x7" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="MODE1 Interrupt Enable Set">
          <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x40"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="MODE2" name="INTENSET" offset="0x7" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="MODE2 Interrupt Enable Set">
          <bitfield name="ALARM0" caption="Alarm 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x40"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x80"/>
        </register>
        <register modes="MODE0" name="INTFLAG" offset="0x8" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="MODE0 Interrupt Flag Status and Clear">
          <bitfield name="CMP0" caption="Compare 0" mask="0x1"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x40"/>
          <bitfield name="OVF" caption="Overflow" mask="0x80"/>
        </register>
        <register modes="MODE1" name="INTFLAG" offset="0x8" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="MODE1 Interrupt Flag Status and Clear">
          <bitfield name="CMP0" caption="Compare 0" mask="0x1"/>
          <bitfield name="CMP1" caption="Compare 1" mask="0x2"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x40"/>
          <bitfield name="OVF" caption="Overflow" mask="0x80"/>
        </register>
        <register modes="MODE2" name="INTFLAG" offset="0x8" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="MODE2 Interrupt Flag Status and Clear">
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x1"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x40"/>
          <bitfield name="OVF" caption="Overflow" mask="0x80"/>
        </register>
        <register name="STATUS" offset="0xA" rw="RW" size="1" initval="0x00" caption="Status">
          <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
        </register>
        <register name="DBGCTRL" offset="0xB" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Run During Debug" mask="0x1"/>
        </register>
        <register name="FREQCORR" offset="0xC" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Frequency Correction">
          <bitfield name="VALUE" caption="Correction Value" mask="0x7F"/>
          <bitfield name="SIGN" caption="Correction Sign" mask="0x80"/>
        </register>
        <register modes="MODE0" name="COUNT" offset="0x10" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="MODE0 Counter Value">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="MODE1" name="COUNT" offset="0x10" rw="RW" access="RWSYNC" size="2" initval="0x0000" caption="MODE1 Counter Value">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFF"/>
        </register>
        <register modes="MODE2" name="CLOCK" offset="0x10" rw="RW" access="RWSYNC" size="4" initval="0x00000000" caption="MODE2 Clock Value">
          <bitfield name="SECOND" caption="Second" mask="0x3F"/>
          <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
          <bitfield name="HOUR" caption="Hour" mask="0x1F000" values="RTC_MODE2_CLOCK__HOUR"/>
          <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
          <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
          <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
        </register>
        <register modes="MODE1" name="PER" offset="0x14" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE1 Counter Period">
          <bitfield name="PER" caption="Counter Period" mask="0xFFFF"/>
        </register>
        <register modes="MODE0" name="COMP" offset="0x18" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="MODE0 Compare n Value">
          <bitfield name="COMP" caption="Compare Value" mask="0xFFFFFFFF"/>
        </register>
